In [1]:
import numpy as np
import pandas as pd

In [2]:
data_one = { 'A': ['A0','A1','A2','A3'], 'B': ['B0','B1','B2','B3']}

In [3]:
data_two = { 'C': ['C0','C1','C2','C3'], 'D': ['D0','D1','d2','D3']}

In [4]:
one = pd.DataFrame(data=data_one)

In [5]:
two = pd.DataFrame(data=data_two)

In [6]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [7]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  d2
3  C3  D3

In [8]:
# Concatenate long the COLUMNS!
pd.concat([one,two],axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  d2
3  A3  B3  C3  D3

In [9]:
# Concatenate long the ROWS!
pd.concat([one,two])

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   d2
3  NaN  NaN   C3   D3

In [10]:
two.columns = one.columns

In [11]:
two

    A   B
0  C0  D0
1  C1  D1
2  C2  d2
3  C3  D3

In [12]:
mydf = pd.concat([one,two], axis=0)

In [13]:
mydf

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  d2
3  C3  D3

In [14]:
mydf.index

Index([0, 1, 2, 3, 0, 1, 2, 3], dtype='int64')

## MERGE

### how='inner' => INNER JOIN

In [15]:
registrations = pd.DataFrame({'reg_id': [1,2,3,4], 'name': ['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id': [1,2,3,4], 'name': ['Xavier','Andrew','Yolanda','Bobo']})

In [16]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [17]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [18]:
# help(pd.merge)

In [19]:
pd.merge(registrations,logins,how='inner',on='name')

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

### how='' => LEFT and/or RIGHT JOIN

In [20]:
pd.merge(left=registrations,right=logins,how='left',on='name')

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    Bobo     4.0
2       3  Claire     NaN
3       4   David     NaN

In [21]:
pd.merge(left=registrations,right=logins,how='right',on='name')

   reg_id     name  log_id
0     NaN   Xavier       1
1     1.0   Andrew       2
2     NaN  Yolanda       3
3     2.0     Bobo       4

### Outer Condition

In [22]:
pd.merge(left=registrations,right=logins,how='outer',on='name')

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0     Bobo     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

In [23]:
registrations = registrations.set_index('name')
print(registrations)

        reg_id
name
Andrew       1
Bobo         2
Claire       3
David        4

In [24]:
pd.merge(registrations,logins,left_index=True,right_on='name',how='inner')

   reg_id  log_id    name
1       1       2  Andrew
3       2       4    Bobo

In [25]:
registrations = registrations.reset_index()
print(registrations)

     name  reg_id
0  Andrew       1
1    Bobo       2
2  Claire       3
3   David       4

In [26]:
registrations.columns = ['reg_name', 'reg_id']
print(registrations)

  reg_name  reg_id
0   Andrew       1
1     Bobo       2
2   Claire       3
3    David       4

In [27]:
pd.merge(registrations,logins,how='inner',left_on="reg_name",right_on='name')

  reg_name  reg_id  log_id    name
0   Andrew       1       2  Andrew
1     Bobo       2       4    Bobo

In [28]:
results = pd.merge(registrations,logins,how='inner',left_on="reg_name",right_on='name')

In [30]:
results.drop('reg_name', axis=1)

   reg_id  log_id    name
0       1       2  Andrew
1       2       4    Bobo

In [31]:
registrations.columns = ['name', 'id']
print(registrations)

     name  id
0  Andrew   1
1    Bobo   2
2  Claire   3
3   David   4

In [32]:
logins.columns = ['id', 'name']
print(logins)

   id     name
0   1   Xavier
1   2   Andrew
2   3  Yolanda
3   4     Bobo

In [33]:
pd.merge(registrations,logins,how='inner',on='name')

     name  id_x  id_y
0  Andrew     1     2
1    Bobo     2     4

In [35]:
pd.merge(registrations,logins,how='inner',on='name',suffixes=('_REG','_LOG'))

     name  id_REG  id_LOG
0  Andrew       1       2
1    Bobo       2       4